//Задача 1: Задайте одномерный массив из 10 целых чисел от 1 до 100.
// Найдите количество элементов массива, значения которых лежат в отрезке [20,90].


/*int [] array = new int[10];
int count = 0;

for(int i = 0; i<array.Length; i++)
{
    array[i]= new Random().Next(1,101);  
    System.Console.Write(array[i]+ " ");

    if (array[i]>=20 && array[i]<=90)
    {
count = count + 1;
    }

}
System.Console.WriteLine();
System.Console.Write(count " элементов массива, значения которых лежат в отрезке [20,90].");*/




//Задача 2: Задайте массив на 10 целых чисел. 
//Напишите программу, которая определяет количество чётных чисел в массиве.


/*int [] array = new int[10];
int count = 0;

for(int i = 0; i<array.Length; i++)
{
    array[i]= new Random().Next(1,21);  
    System.Console.Write(array[i]+ " ");
    
    if (array[i] % 2 == 0)
    {
        count = count + 1;
    }
}
System.Console.WriteLine();
System.Console.Write(count + " четных чисел в массиве");*/




//Задача 3: Задайте массив из вещественных чисел с ненулевой дробной частью.
// Найдите разницу между максимальным и минимальным элементов массива.

